[{"Product Name":"Corsicana Tote","Price":300,"Description":"With its unique yet classic style, the Corsicana Tote is optimized for originality. Designed in true Tesla fashion, these robust and timeless totes are made of supple automotive-grade leather, just like the seats in your car. Suitable for use as an everyday handbag or as a business case, the Corsicana tote will comfortably hold a 15-inch laptop as well as all your other business necessities. The Corsicana Tote is named after a Tesla Supercharger location in Texas.","Type":"Design Collection","Sizes":"","Color":"","Qty":12},
{"Product Name":"Men's Modena Leather Jacket","Price":400,"Description":"The Modena Leather Jacket is made of premium, full-grain sheep leather with quilted Cupro lining. The jacket is designed with clean lines and a slim fashion fit.  Details such as a subtle debossed tone-on-tone Tesla logo as well as Tesla’s signature red contrast stitching and inside pocket welts complete the premium look and feel.  \n
To make this both a stylish and functional piece, we have incorporated a sport stand-up collar, light padding on elbows, pockets with D-ring for attaching keys, headphone cord management, and pockets large enough to fit oversized smart phones.

The Modena Leather Jacket is named after a Tesla Supercharger location in Italy. ","Type":"Design Collection","Sizes":"s, m, l, xl, xxl","Color":"","Qty":4},
{"Product Name":"Women's Modena Leather Jacket","Price":400,"Description":"The Modena Leather Jacket is made of premium, full-grain sheep leather with quilted Cupro lining. The jacket is designed with clean lines and a slim fashion fit.  Details such as a subtle debossed tone-on-tone Tesla logo as well as Tesla’s signature red contrast stitching and inside pocket welts complete the premium look and feel.  \n
To make this both a stylish and functional piece, we have incorporated a sport stand-up collar, light padding on elbows, pockets with D-ring for attaching keys, headphone cord management, and pockets large enough to fit oversized smart phones.

The Modena Leather Jacket is named after a Tesla Supercharger location in Italy. ","Type":"designcollection, outerwear","Sizes":"xs, s, m, l, xl","Color":"","Qty":5},
{"Product Name":"Men's Touch Screen Leather Driving Gloves","Price":100,"Description":"Traditional craftsmanship meets high-tech innovation in our stylish driving gloves, the perfect pairing for your Model S.\n
Artfully crafted from ultra-soft sheepskin leather, our gloves will keep you warm during the cold winter months while allowing you to use your touchscreen or smartphone without having to be removed","Type":"designcollection, outerwear","Sizes":"s, m, l, xl, xxl","Color":"","Qty":0},
{"Product Name":"Women's Touch Screen Leather Driving Gloves","Price":100,"Description":"Traditional craftsmanship meets high-tech innovation in our stylish driving gloves, the perfect pairing for your Model S.\n
Artfully crafted from ultra-soft sheepskin leather, our gloves will keep you warm during the cold winter months while allowing you to use your touchscreen or smartphone without having to be removed","Type":"Design Collection","Sizes":"s, m, l","Color":"","Qty":3},
{"Product Name":"Lully Pouch","Price":40,"Description":"Simple elegance meets exceptional functionality.  Our Lully Pouch is designed in true Tesla style for the true Tesla fan. This accessory is handcrafted from the same automotive-grade leather used for your Model S seats. The leather color choices of black, tan or gray match your car’s interior perfectly. The Lully Pouch is named after a Tesla Supercharger location in Switzerland, and measures 4.5","Type":"Design Collection","Sizes":"","Color":"black, gray, tan","Qty":7},
{"Product Name":"Maumee Key Fob Sleeve","Price":30,"Description":"Simple elegance meets exceptional functionality.  Our Maumee Key Fob Sleeve is designed in true Tesla style for the true Tesla fan.  This accessory is handcrafted from the same automotive-grade leather used for your Model S seats.  The leather color choices of black, tan or gray match your car’s interior perfectly.  The Maumee Key Fob Sleeve is named after a Tesla Supercharger location in Ohio.","Type":"Design Collection","Sizes":"","Color":"black, gray, tan","Qty":53},
{"Product Name":"Bethesda iPad Sleeve","Price":100,"Description":"Simple elegance meets exceptional functionality. Our Bethesda iPad Sleeve is designed in true Tesla style for the true Tesla fan. This accessory is handcrafted from the same automotive-grade leather used for your Model S seats. The leather color choices of black, tan or gray match your car’s interior perfectly. The Bethesda iPad Sleeve is named after a Tesla Supercharger location in Maryland.","Type":"Design Collection","Sizes":"","Color":"black, gray, tan","Qty":22},
{"Product Name":"Rockford iPhone 5/5S Sleeve","Price":40,"Description":"Simple elegance meets exceptional functionality. Our Rockford iPhone Sleeve is designed in true Tesla style for the true Tesla fan. This accessory is handcrafted from the same automotive-grade leather used for your Model S seats. The leather color choices of black, tan or gray match your car’s interior perfectly. The Rockford iPhone Sleeve is named after a Tesla Supercharger location in Illinois.","Type":"Design Collection","Sizes":"","Color":"black, gray, tan","Qty":100},
{"Product Name":"iPhone 6/6S Leather Case","Price":45,"Description":"iPhone 6/6S case made in our Nappa grain leather.","Type":"designcollection, acc","Sizes":"","Color":"","Qty":47},
{"Product Name":"iPhone 6/6S Plus Leather Case","Price":45,"Description":"iPhone 6/6S Plus case made in our Nappa grain leather.","Type":"designcollection, acc","Sizes":"","Color":"","Qty":95},
{"Product Name":"","Price":null,"Description":"","Type":"","Sizes":"","Color":"","Qty":null}]
